
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 10 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES-HOST
  * azurerm_key_vault_secret.POSTGRES-HOST-V15
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES-USER-V15
  * azurerm_key_vault_secret.servicebus-pricing-tier
  * module.application_insights.azurerm_application_insights.this
  * module.postgresql.random_password.password
  * module.postgresql-v15.random_password.password
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
* Replace
  * module.servicebus-sdt-queue.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-HOST" {
        id                      = "https://civil-sdt-aat.vault.azure.net/secrets/civil-sdt-POSTGRES-HOST/6503ebd373d04231827cb267ac070313"
        name                    = "civil-sdt-POSTGRES-HOST"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-HOST-V15 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-HOST-V15" {
        id                      = "https://civil-sdt-aat.vault.azure.net/secrets/civil-sdt-POSTGRES-HOST-V15/d3ab62dae90543c9a27fb3734e7b3eba"
        name                    = "civil-sdt-POSTGRES-HOST-V15"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER" {
        id                      = "https://civil-sdt-aat.vault.azure.net/secrets/civil-sdt-POSTGRES-USER/8d9eaea20c224995bacc6124b33ab3ad"
        name                    = "civil-sdt-POSTGRES-USER"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V15 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER-V15" {
        id                      = "https://civil-sdt-aat.vault.azure.net/secrets/civil-sdt-POSTGRES-USER-V15/23d525866a584e67ac1b5c3aa27faf08"
        name                    = "civil-sdt-POSTGRES-USER-V15"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.servicebus-pricing-tier will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus-pricing-tier" {
        id                      = "https://civil-sdt-aat.vault.azure.net/secrets/civil-sdt-servicebus-pricing-tier/ec8f49ce375846bda379808fc1528a17"
        name                    = "civil-sdt-servicebus-pricing-tier"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.Insights/components/civil-sdt-appinsights-aat"
        name                                  = "civil-sdt-appinsights-aat"
        tags                                  = {
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-sdt.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
        # (16 unchanged attributes hidden)
    }

  # module.postgresql.random_password.password will be updated in-place
  ~ resource "random_password" "password" {
        id               = "none"
        # (13 unchanged attributes hidden)
    }

  # module.postgresql-v15.random_password.password will be updated in-place
  ~ resource "random_password" "password" {
        id               = "none"
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat"
        name                                = "civil-sdt-servicebus-aat"
        tags                                = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#civil-sdt"
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-sdt.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule will be updated in-place
  ~ resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/authorizationRules/SendAndListenSharedAccessKey"
        name                        = "SendAndListenSharedAccessKey"
        # (8 unchanged attributes hidden)
    }

  # module.servicebus-sdt-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "civil-sdt-servicebus-aat"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "civil-sdt-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "civil-sdt-in-out-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 10 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":464,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->